
import random
class raton:
    def __init__(self):
        pass 

    def movimientos():
        arriba = 'w'
        abajo = 's'
        izquierda = 'a'
        derecha = 'd'



# Laberinto grande
print("\n🎮 LABERINTO 3 (Grande):")
print("╔════════════════════════════════════════╗")
print("║    r ██                      ██    g ██║")
print("║  ██  ██████████  ██████  ██████  ██  ██║")
print("║  ██          ██  ██  ██      ██  ██  ██║")
print("║  ██████████  ██  ██  ██████  ██  ██  ██║")
print("║          ██  ██      ██  ██      ██  ██║")
print("║████████  ██  ██████  ██  ██████████  ██║")
print("║      ██  ██      ██  ██          ██  ██║")
print("║  ██  ██  ██████  ██  ██████  ██  ██  ██║")
print("║  ██  ██      ██  ██      ██  ██      ██║")
print("║  ██  ██████  ██  ██████  ██  ██████████║")
print("║  ██      ██  ██      ██  ██          ██║")
print("║  ██████  ██  ██████  ██  ██████████  ██║")
print("║      ██  ██      ██          ██      ██║")
print("║████  ██  ██████  ██████████  ██  ██████║")
print("║  ██  ██      ██          ██  ██      ██║")
print("║  ██  ██████  ██████████  ██  ██████  ██║")
print("║  ██      ██          ██  ██      ██  ██║")
print("║  ██████  ██████████  ██  ██████  ██  ██║")
print("║      ██          ██              ██    ║")
print("║████████████████████████████████████████║")
print("╚════════════════════════════════════════╝")



print("\n💡 Entrada: arriba a la izquierda")
print("🎯 Salida: abajo a la derecha\n")










